package telran.bitwise.controller;

/*
    1 ->  1
    2 ->  10
    3 ->  11
    4 ->  100
    5 ->  101
    6 ->  110
    8 ->  1000
    10 -> 1010
    12 -> 1100
    16 -> 10000
    20 -> 10100
    Отрицательное число записывается как 1 и обратное число
---------------------------------------------
    00000000  ->  001
    00000010  ->  002
    +
    10000010  -> -002
    ---------------
    10000100  -> -004
    ===============
    01111111  ->  127
    +
    10000001  -> -127
    -----------------
    00000000

    10000001 -> -127
    -
    00000001 -> 001
    -----------------
    10000000 -> -128

    01111111  ->  127
    +
    00000001  -> 001
    ------------------
    10000000 -> -128

    | - побитовое сложение
    & - побитовое умножение

    00000010 -> 2
    |
    00000110 -> 6
    --------
    00000110 -> 6

    00000011 -> 3
    &
    00000101 -> 5
    ------------
    00000001 -> 1
 */
public class BitwiseAppl {
    public static void main(String[] args) {
        int x = 10;
       // int res = x*2;
        int res = x << 1 ; //Побитовый сдвиг равноценен умножению на 2 и делается быстрее
        System.out.println(res);
        int y = 54;
        res = y >> 2;
        System.out.println(res);
        res = (1 << 31) - 1;
        System.out.println(res);
        res = 2 | 6;
        System.out.println(res);
        res = 3 & 5;
        System.out.println(res);
    }
}
